[
  {
    "url": "www.tiktok.com",
    "refresh": 1000,
    "notes": "this set of rules adds a volume bar and a time scrub bar to videos on tiktok.com. It also uses the refresh property to reapply the rules every second so newly loaded videos will get the controls. Unfortunately tiktok now has some javascript constantly resetting the volume, so this is useless even though the bar can be interacted with. It now only serves as an example.",
    "elements": [
      {
        "selector": "div > video.video-player, div > video.video",
        "setAttributes": {
          "controls": "true"
        }
      },
      {
        "selector": "DIV>DIV.play-button.theme, DIV>SPAN.event-delegate-mask, DIV>DIV.coverBox",
        "setStyles":{
          "display":"none"
        }
      }
    ]
  },
  {
    "url": "www.youtube.com",
    "notes": "This set of rules breaks the logo in the top left on youtube.com to demonstrate the ability to remove an attribute.",
    "elements": [
      {
        "selector": "path",
        "removeAttributes": [
          "d"
        ]
      }
    ]
  },
  {
    "url": "www.youtube.com/watch?",
    "notes": "This shows that multiple url's rules can apply on one page. Any youtube video will have the logo destroyed by the previous url's rules, and will have a purple nav bar because of this url's rules.",
    "elements": [
      {
        "selector": "#masthead",
        "setStyles": {
		  "background-color":"purple"
		}
      }
    ]
  },
  {
    "url": "www.youtube.com/watch?",
    "notes": "This shows a use of the notStyles identifier. Any div that doesn't align-items:center on youtube.com videos will be blue",
    "elements": [
      {
        "selector": "div",
        "notStyles": {
          "align-items": "center"
        },
        "setStyles": {
		  "background-color":"blue"
		}
      }
    ]
  },
  {
    "url": "www.youtube.com/watch?",
	"tryAgain": 7000,
    "notes": "This breaks comment profile pictures on youtube videos. It uses the tryAgain property to apply the rules once more 7 seconds after the page loads. You'll need to scroll down to the comment section quickly after the page loads for this to apply. Normally you'd use the refresh property in this case. Note any other site rules that apply to this page will also reapply.",
    "elements": [
      {
        "selector": "img",
        "removeAttributes": [
		  "src"
        ]
      }
    ]
  }
]